# Программа для вычисления среднего показателя температуры воздуха в Кыргызстане на сегодня.

region_1 = float(input('Введите текущую температуру воздуха в Чуйской области:' + " "))
region_2 = float(input('Введите текущую температуру воздуха в Талаской области:' + " "))
region_3 = float(input('Введите текущую температуру воздуха в Иссык-Кульской области:' + " "))
region_4 = float(input('Введите текущую температуру воздуха в Нарынской области:' + " "))
region_5 = float(input('Введите текущую температуру воздуха в Ошской области:' + " "))
region_6 = float(input('Введите текущую температуру воздуха в Джалал-Абадской области:' + " "))
region_7 = float(input('Введите текущую температуру воздуха в Баткенской области:' + " "))

sum_of_region = (region_1 + region_2 + region_3 + region_4 + region_5 + region_6 + region_7)

average = sum_of_region/7
rounded_average = '%.1f' % average

print()
print(f"Средний показатель температуры воздуха по КР на сегодня {rounded_average} °C.")
